Revit 2027 API
AlphanumericRevisionSettings(AlphanumericRevisionSettings) Constructor
 Constructs a new copy of the input AlphanumericRevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AlphanumericRevisionSettings(
	AlphanumericRevisionSettings other
)
Public Sub New (
	other As AlphanumericRevisionSettings
)
public:
AlphanumericRevisionSettings(
	AlphanumericRevisionSettings^ other
)
new :
        other : AlphanumericRevisionSettings -> AlphanumericRevisionSettings
Parameters
other AlphanumericRevisionSettings
Exceptions
Exception | Condition
ArgumentException |  other is not a valid AlphanumericRevisionSettings.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AlphanumericRevisionSettings Class
AlphanumericRevisionSettings Overload
Autodesk.Revit.DB Namespace